app/controllers/referees_controller.rb

INSERT INTO "referees" ("created_at", "name", "players_per_game", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 08 Nov 2013 14:39:47 UTC +00:00], ["name", "reffin"], ["players_per_game", 3], ["updated_at", Fri, 08 Nov 2013 14:39:47 UTC +00:00], ["user_id", 14]]
---
  def create
    @referee = current_user.referees.build(acceptable_params)
    if @referee.save then