app/controllers/users_controller.rb

  def create
    @user = User.new(permittedparams)

    if @user.save then
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "usersname") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(permittedparams)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["username", "asdfgh12"], ["email", "123adsfasdf@example.comx"], ["updated_at", Sun, 29 Sep 2013 17:44:56 UTC +00:00]]